In [1]:
import pandas as pd

In [4]:
#csv -- comma separated values
#tsv -- tab separated values

data = pd.read_csv('example.csv')

data

   account_number                      title     type  amount        date
0               1              Another title  Expense  -20000  01-03-2021
1               1                  Something  Expense  -20000  01-01-2021
2               1                    A Title   Income   80000  01-02-2021
3               1                New Expense  Expense  -60000  01-03-2022
4               2               A new income   Income  100000  01-03-2022
5               2              A new expense  Expense  -55000  09-09-2022
6               2  A brand new income source   Income   30000  09-10-2022
7               2               Some expense  Expense  -17000  09-11-2022
8            1234       New expense for 1234  Expense     -50  01-02-2022

In [5]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [11]:
#look at the first 5 rows

#data.head()

#use tail to look at the last 5 rows

data.tail()

   account_number                      title     type  amount        date
4               2               A new income   Income  100000  01-03-2022
5               2              A new expense  Expense  -55000  09-09-2022
6               2  A brand new income source   Income   30000  09-10-2022
7               2               Some expense  Expense  -17000  09-11-2022
8            1234       New expense for 1234  Expense     -50  01-02-2022

In [12]:
#basic statictical measures of all numeric fields in the data set
data.describe()

       account_number         amount
count        9.000000       9.000000
mean       138.444444    4216.666667
std        410.833638   55738.205030
min          1.000000  -60000.000000
25%          1.000000  -20000.000000
50%          2.000000  -17000.000000
75%          2.000000   30000.000000
max       1234.000000  100000.000000

In [14]:
#show the name of the columns
data.columns

Index(['account_number', 'title', 'type', 'amount', 'date'], dtype='object')

In [18]:
#get the number of values in each column
data.count()

account_number    9
title             9
type              9
amount            9
date              9
dtype: int64

In [19]:
#display the data types
data.dtypes

#int64 means they are numric values 64-bit number (requires 64 bit to store that number)
#object may be string or something else. it is basically "other"

account_number     int64
title             object
type              object
amount             int64
date              object
dtype: object

In [21]:
#select a portion of our data
#similar way you work with dictionary but this is not a dictionary! 
#it is a pandas thing not a python's thing. it is a dataframe not a dictionary!
data['title']

0                Another title
1                    Something
2                      A Title
3                  New Expense
4                 A new income
5                A new expense
6    A brand new income source
7                 Some expense
8         New expense for 1234
Name: title, dtype: object

In [23]:
print(type(data['title']))

#as is shown, this is a series not a dataframe

<class 'pandas.core.series.Series'>

In [24]:
#single column as dataframe
#use double brackets

data[['title']]

                       title
0              Another title
1                  Something
2                    A Title
3                New Expense
4               A new income
5              A new expense
6  A brand new income source
7               Some expense
8       New expense for 1234

In [26]:
#filtering: get all the incomes
data[data['type'] == 'Income']

#write the condition first then put all in data so it returns all columns

   account_number                      title    type  amount        date
2               1                    A Title  Income   80000  01-02-2021
4               2               A new income  Income  100000  01-03-2022
6               2  A brand new income source  Income   30000  09-10-2022

In [27]:
#all amounts are positive

data[data['amount'] > 0]

   account_number                      title    type  amount        date
2               1                    A Title  Income   80000  01-02-2021
4               2               A new income  Income  100000  01-03-2022
6               2  A brand new income source  Income   30000  09-10-2022

In [31]:
#filter titles that start with 'A'
data[data['title'].str.startswith('A')]

   account_number                      title     type  amount        date
0               1              Another title  Expense  -20000  01-03-2021
2               1                    A Title   Income   80000  01-02-2021
4               2               A new income   Income  100000  01-03-2022
5               2              A new expense  Expense  -55000  09-09-2022
6               2  A brand new income source   Income   30000  09-10-2022